var app = getApp();
Page({

    /**
     * 页面的初始数据
     */
    data: {
        userdata: {
            name: '',
            broad_country: '中国大陆',
            phone: '',
            sfz_code: '',
            birth: '请选择日期',
            sexy: 1,
            blood_type: '',
            area: '请选择地区',
            addr: '',
            postcode: '',
            e_mail: '',
            cloth_size: '',
            contact_name: '',
            contact_phone: '',
            pass_code: '',
            surname: '',
            en_name: '',
            issue_date: '请选择签发日期Date of issues',
            expiry_date: '请选择有效期Date of expiry',
            isattended: '',
            personbest: '',
            personbestmatch: '',
            wishfinish: '请注明预期完赛时间'
        },
        data_ready:false,
        sign_ok:false,
        country_continent: ["亚洲", "欧洲", "非洲", "南美洲", "北美洲", "大洋洲"],
        country_arr: [["中国大陆", "中国香港", "中国澳门", "中国台湾", "蒙古", "朝鲜", "韩国", "日本", "菲律宾", "越南", "老挝", "柬埔寨", "缅甸", "泰国", "马来西亚", "文莱", "新加坡", "印度尼西亚", "东帝汶", "尼泊尔", "不丹", "孟加拉国", "印度", "巴基斯坦", "斯里兰卡", "马尔代夫", "哈萨克斯坦", "吉尔吉斯斯坦", "塔吉克斯坦", "乌兹别克斯坦", "土库曼斯坦", "阿富汗", "伊拉克", "伊朗", "叙利亚", "约旦", "黎巴嫩", "以色列", "巴勒斯坦", "沙特阿拉伯", "巴林", "卡塔尔", "科威特", "阿拉伯联合酋长国", "阿曼", "也门", "格鲁吉亚", "亚美尼亚", "阿塞拜疆", "土耳其", "塞浦路斯"], ["英国", "爱尔兰", "荷兰", "比利时", "卢森堡", "法国", "摩纳哥", "芬兰", "瑞典", "挪威", "冰岛", "丹麦", "爱沙尼亚", "拉脱维亚", "立陶宛", "白俄罗斯", "俄罗斯", "乌克兰", "摩尔多瓦", "波兰", "捷克", "斯洛伐克", "匈牙利", "德国", "奥地利", "瑞士", "列支敦士登", "罗马尼亚", "保加利亚", "塞尔维亚", "马其顿", "阿尔巴尼亚", "希腊", "斯洛文尼亚", "克罗地亚", "波斯尼亚和墨塞哥维那", "意大利", "梵蒂冈", "圣马力诺", "马耳他", "西班牙", "葡萄牙", "安道尔"], ["埃及", "利比亚", "苏丹", "突尼斯", "阿尔及利亚", "摩洛哥", "亚速尔群岛（葡）", "马德拉群岛（葡）", "埃塞俄比亚", "厄立特里亚", "索马里", "吉布提", "肯尼亚", "坦桑尼亚", "乌干达", "卢旺达", "布隆迪", "塞舌尔", "乍得", "中非", "喀麦隆", "赤道几内亚", "加蓬", "刚果共和国（布）", "刚果民主共和国（金）", "圣多美及普林西比", "毛里塔尼亚", "西撒哈拉", "塞内加尔", "冈比亚", "马里", "布基纳法索", "几内亚", "几内亚比绍", "佛得角", "塞拉利昂", "利比里亚", "科特迪瓦", "加纳", "多哥", "贝宁", "尼日尔", "加那利群岛（西）", "赞比亚", "安哥拉", "津巴布韦", "马拉维", "莫桑比克", "博茨瓦纳", "纳米比亚", "南非", "斯威士兰", "莱索托", "马达加斯加", "科摩罗", "毛里求斯", "留尼旺（法）", "圣赫勒拿（英）"], ["哥伦比亚", "委内瑞拉", "圭亚那", "苏里南", "厄瓜多尔", "秘鲁", "巴西", "玻利维亚", "智利", "巴拉圭", "乌拉圭", "阿根廷", "圭亚那（法）"], ["美国", "加拿大", "古巴", "巴拿马", "巴哈马", "伯利兹", "巴巴多斯", "哥斯达黎加", "萨尔瓦多", "格林纳达", "危地马拉", "洪都拉斯", "海地", "牙买加", "圣卢西亚", "墨西哥", "尼加拉瓜", "多米尼加", "多米尼克", "圣文森特和格林纳丁斯", "特立尼达和多巴哥", "安提瓜和巴布达", "圣基茨和尼维斯"], ["澳大利亚", "新西兰", "巴布亚新几内亚", "所罗门群岛", "瓦努阿图", "密克罗尼西亚", "马绍尔群岛", "帕劳", "瑙鲁", "基里巴斯", "图瓦卢", "萨摩亚", "斐济群岛", "汤加", "库克群岛（新）", "关岛（美）", "新喀里多尼亚（法）", "法属波利尼西亚", "皮特凯恩岛（英）", "瓦利斯与富图纳（法）", "纽埃（新）", "托克劳（新）", "美属萨摩亚", "北马里亚纳（美）"]],
        show_country: ["中国大陆", "中国香港", "中国澳门", "中国台湾", "蒙古", "朝鲜", "韩国", "日本", "菲律宾", "越南", "老挝", "柬埔寨", "缅甸", "泰国", "马来西亚", "文莱", "新加坡", "印度尼西亚", "东帝汶", "尼泊尔", "不丹", "孟加拉国", "印度", "巴基斯坦", "斯里兰卡", "马尔代夫", "哈萨克斯坦", "吉尔吉斯斯坦", "塔吉克斯坦", "乌兹别克斯坦", "土库曼斯坦", "阿富汗", "伊拉克", "伊朗", "叙利亚", "约旦", "黎巴嫩", "以色列", "巴勒斯坦", "沙特阿拉伯", "巴林", "卡塔尔", "科威特", "阿拉伯联合酋长国", "阿曼", "也门", "格鲁吉亚", "亚美尼亚", "阿塞拜疆", "土耳其", "塞浦路斯"],
        country_value: [0, 0],
        area_province: ["北京", "天津", "河北省", "山西省", "内蒙古自治区", "辽宁省", "吉林省", "黑龙江省", "上海", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西壮族自治区", "海南省", "重庆", "四川省", "贵州省", "云南省", "西藏自治区", "陕西省", "甘肃省", "青海省", "宁夏回族自治区", "新疆维吾尔自治区", "港澳台地区", "海外"],
        area_city: [["北京市"], ["天津市"], ["石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "衡水市", "廊坊市", "沧州市"], ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"], ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"], ["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"], ["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"], ["哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "大兴安岭地区"], ["上海市"], ["南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市"], ["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "舟山市", "衢州市", "金华市", "台州市", "丽水市"], ["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "巢湖市", "六安市", "亳州市", "池州市", "宣城市"], ["福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"], ["南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"], ["济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "莱芜市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市"], ["郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市", "济源市"], ["武汉市", "黄石市", "十堰市", "宜昌市", "襄樊市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "恩施土家族苗族自治州", "仙桃市", "潜江市", "天门市", "神农架林区"], ["长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西土家族苗族自治州"], ["广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"], ["南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"], ["海口市", "三亚市", "五指山市", "琼海市", "儋州市", "文昌市", "万宁市", "东方市", "定安县", "屯昌县", "澄迈县", "临高县", "白沙黎族自治县", "昌江黎族自治县", "乐东黎族自治县", "陵水黎族自治县", "保亭黎族苗族自治县", "琼中黎族苗族自治县", "西沙群岛", "南沙群岛", "中沙群岛的岛礁及其海域"], ["重庆市"], ["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"], ["贵阳市", "六盘水市", "遵义市", "安顺市", "铜仁地区", "黔西南布依族苗族自治州", "毕节地区", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"], ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "思茅市", "临沧市", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"], ["拉萨市", "昌都地区", "山南地区", "日喀则地区", "那曲地区", "阿里地区", "林芝地区"], ["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市"], ["兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "临夏回族自治州", "甘南藏族自治州"], ["西宁市", "海东地区", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"], ["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"], ["乌鲁木齐市", "克拉玛依市", "吐鲁番地区", "哈密地区", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州", "喀什地区", "和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "石河子市", "阿拉尔市", "图木舒克市", "五家渠市"], ["台湾省", "香港特别行政区", "澳门特别行政区"], ["海外"]],
        area_area: [[["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县", "其他"]], [["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河县", "静海县", "蓟县"]], [["井陉县", "井陉矿区", "元氏县", "平山县", "新乐市", "新华区", "无极县", "晋州市", "栾城县", "桥东区", "桥西区", "正定县", "深泽县", "灵寿县", "藁城市", "行唐县", "裕华区", "赞皇县", "赵县", "辛集市", "长安区", "高邑县", "鹿泉市"], ["丰南区", "丰润区", "乐亭县", "古冶区", "唐海县", "开平区", "滦南县", "滦县", "玉田县", "路北区", "路南区", "迁安市", "迁西县", "遵化市"], ["北戴河区", "卢龙县", "山海关区", "抚宁县", "昌黎县", "海港区", "青龙满族自治县"], ["丛台区", "临漳县", "复兴区", "大名县", "峰峰矿区", "广平县", "成安县", "曲周县", "武安市", "永年县", "涉县", "磁县", "肥乡县", "邯山区", "邯郸县", "邱县", "馆陶县", "魏县", "鸡泽县"], ["临城县", "临西县", "任县", "内丘县", "南和县", "南宫市", "威县", "宁晋县", "巨鹿县", "平乡县", "广宗县", "新河县", "柏乡县", "桥东区", "桥西区", "沙河市", "清河县", "邢台县", "隆尧县"], ["北市区", "南市区", "博野县", "唐县", "安国市", "安新县", "定兴县", "定州市", "容城县", "徐水县", "新市区", "易县", "曲阳县", "望都县", "涞水县", "涞源县", "涿州市", "清苑县", "满城县", "蠡县", "阜平县", "雄县", "顺平县", "高碑店市", "高阳县"], ["万全县", "下花园区", "宣化区", "宣化县", "尚义县", "崇礼县", "康保县", "张北县", "怀安县", "怀来县", "桥东区", "桥西区", "沽源县", "涿鹿县", "蔚县", "赤城县", "阳原县"], ["丰宁满族自治县", "兴隆县", "双桥区", "双滦区", "围场满族蒙古族自治县", "宽城满族自治县", "平泉县", "承德县", "滦平县", "隆化县", "鹰手营子矿区"], ["冀州市", "安平县", "故城县", "景县", "枣强县", "桃城区", "武强县", "武邑县", "深州市", "阜城县", "饶阳县"], ["三河市", "固安县", "大厂回族自治县", "大城县", "安次区", "广阳区", "文安县", "永清县", "霸州市", "香河县"], ["东光县", "任丘市", "南皮县", "吴桥县", "孟村回族自治县", "新华区", "沧县", "河间市", "泊头市", "海兴县", "献县", "盐山县", "肃宁县", "运河区", "青县", "黄骅市"]], [["万柏林区", "古交市", "娄烦县", "小店区", "尖草坪区", "晋源区", "杏花岭区", "清徐县", "迎泽区", "阳曲县"], ["南郊区", "城区", "大同县", "天镇县", "左云县", "广灵县", "新荣区", "浑源县", "灵丘县", "矿区", "阳高县"], ["城区", "平定县", "盂县", "矿区", "郊区"], ["城区", "壶关县", "屯留县", "平顺县", "武乡县", "沁县", "沁源县", "潞城市", "襄垣县", "郊区", "长子县", "长治县", "黎城县"], ["城区", "沁水县", "泽州县", "阳城县", "陵川县", "高平市"], ["右玉县", "山阴县", "平鲁区", "应县", "怀仁县", "朔城区"], ["介休市", "和顺县", "太谷县", "寿阳县", "左权县", "平遥县", "昔阳县", "榆次区", "榆社县", "灵石县", "祁县"], ["万荣县", "临猗县", "垣曲县", "夏县", "平陆县", "新绛县", "永济市", "河津市", "盐湖区", "稷山县", "绛县", "芮城县", "闻喜县"], ["五台县", "五寨县", "代县", "保德县", "偏关县", "原平市", "宁武县", "定襄县", "岢岚县", "忻府区", "河曲县", "神池县", "繁峙县", "静乐县"], ["乡宁县", "侯马市", "古县", "吉县", "大宁县", "安泽县", "尧都区", "曲沃县", "永和县", "汾西县", "洪洞县", "浮山县", "翼城县", "蒲县", "襄汾县", "隰县", "霍州市"], ["中阳县", "临县", "交口县", "交城县", "兴县", "孝义市", "岚县", "文水县", "方山县", "柳林县", "汾阳市", "石楼县", "离石区"]], [["和林格尔县", "回民区", "土默特左旗", "托克托县", "新城区", "武川县", "清水河县", "玉泉区", "赛罕区"], ["东河区", "九原区", "固阳县", "土默特右旗", "昆都仑区", "白云矿区", "石拐区", "达尔罕茂明安联合旗", "青山区"], ["乌达区", "海勃湾区", "海南区"], ["元宝山区", "克什克腾旗", "喀喇沁旗", "宁城县", "巴林右旗", "巴林左旗", "敖汉旗", "松山区", "林西县", "红山区", "翁牛特旗", "阿鲁科尔沁旗"], ["奈曼旗", "库伦旗", "开鲁县", "扎鲁特旗", "科尔沁区", "科尔沁左翼中旗", "科尔沁左翼后旗", "霍林郭勒市"], ["东胜区", "乌审旗", "伊金霍洛旗", "准格尔旗", "杭锦旗", "达拉特旗", "鄂东胜区", "鄂托克前旗", "鄂托克旗"], ["扎兰屯市", "新巴尔虎右旗", "新巴尔虎左旗", "根河市", "海拉尔区", "满洲里市", "牙克石市", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "阿荣旗", "陈巴尔虎旗", "额尔古纳市"], ["临河区", "乌拉特中旗", "乌拉特前旗", "乌拉特后旗", "五原县", "杭锦后旗", "磴口县"], ["丰镇市", "兴和县", "凉城县", "化德县", "卓资县", "商都县", "四子王旗", "察哈尔右翼中旗", "察哈尔右翼前旗", "察哈尔右翼后旗", "集宁区"], ["乌兰浩特市", "扎赉特旗", "科尔沁右翼中旗", "科尔沁右翼前旗", "突泉县", "阿尔山市"], ["东乌珠穆沁旗", "二连浩特市", "多伦县", "太仆寺旗", "正蓝旗", "正镶白旗", "苏尼特右旗", "苏尼特左旗", "西乌珠穆沁旗", "锡林浩特市", "镶黄旗", "阿巴嘎旗"], ["阿拉善右旗", "阿拉善左旗", "额济纳旗"]], [["东陵区", "于洪区", "和平区", "大东区", "康平县", "新民市", "沈北新区", "沈河区", "法库县", "皇姑区", "苏家屯区", "辽中县", "铁西区"], ["中山区", "庄河市", "旅顺口区", "普兰店市", "沙河口区", "瓦房店市", "甘井子区", "西岗区", "金州区", "长海县"], ["千山区", "台安县", "岫岩满族自治县", "海城市", "立山区", "铁东区", "铁西区"], ["东洲区", "抚顺县", "新宾满族自治县", "新抚区", "望花区", "清原满族自治县", "顺城区"], ["南芬区", "平山区", "明山区", "本溪满族自治县", "桓仁满族自治县", "溪湖区"], ["东港市", "元宝区", "凤城市", "宽甸满族自治县", "振兴区", "振安区"], ["义县", "凌河区", "凌海市", "北镇市", "古塔区", "太和区", "黑山县"], ["大石桥市", "盖州市", "站前区", "老边区", "西市区", "鲅鱼圈区"], ["太平区", "彰武县", "新邱区", "海州区", "清河门区", "细河区", "蒙古族自治县"], ["太子河区", "宏伟区", "弓长岭区", "文圣区", "灯塔市", "白塔区", "辽阳县"], ["兴隆台区", "双台子区", "大洼县", "盘山县"], ["开原市", "昌图县", "清河区", "西丰县", "调兵山市", "铁岭县", "银州区"], ["凌源市", "北票市", "双塔区", "喀喇沁左翼蒙古族自治县", "建平县", "朝阳县", "龙城区"], ["兴城市", "南票区", "建昌县", "绥中县", "连山区", "龙港区"]], [["九台市", "二道区", "农安县", "南关区", "双阳区", "宽城区", "德惠市", "朝阳区", "榆树市", "绿园区"], ["丰满区", "昌邑区", "桦甸市", "永吉县", "磐石市", "舒兰市", "船营区", "蛟河市", "龙潭区"], ["伊通满族自治县", "公主岭市", "双辽市", "梨树县", "铁东区", "铁西区"], ["东丰县", "东辽县", "西安区", "龙山区"], ["东昌区", "二道江区", "柳河县", "梅河口市", "辉南县", "通化县", "集安市"], ["临江市", "八道江区", "抚松县", "江源区", "长白朝鲜族自治县", "靖宇县"], ["干安县", "前郭尔罗斯蒙古族自治县", "宁江区", "扶余县", "长岭县"], ["大安市", "洮北区", "洮南市", "通榆县", "镇赉县"], ["和龙市", "图们市", "安图县", "延吉市", "敦化市", "汪清县", "珲春市", "龙井市"]], [["五常市", "依兰县", "南岗区", "双城市", "呼兰区", "哈尔滨市道里区", "宾县", "尚志市", "巴彦县", "平房区", "延寿县", "方正县", "木兰县", "松北区", "通河县", "道外区", "阿城区", "香坊区"], ["依安县", "克东县", "克山县", "富拉尔基区", "富裕县", "建华区", "拜泉县", "昂昂溪区", "梅里斯达斡尔族区", "泰来县", "甘南县", "碾子山区", "讷河市", "铁锋区", "龙江县", "龙沙区"], ["城子河区", "密山市", "恒山区", "梨树区", "滴道区", "虎林市", "鸡东县", "鸡冠区", "麻山区"], ["东山区", "兴安区", "兴山区", "南山区", "向阳区", "工农区", "绥滨县", "萝北县"], ["友谊县", "四方台区", "宝山区", "宝清县", "尖山区", "岭东区", "集贤县", "饶河县"], ["大同区", "杜尔伯特蒙古族自治县", "林甸县", "红岗区", "肇州县", "肇源县", "胡路区", "萨尔图区", "龙凤区"], ["上甘岭区", "乌伊岭区", "乌马河区", "五营区", "伊春区", "南岔区", "友好区", "嘉荫县", "带岭区", "新青区", "汤旺河区", "红星区", "美溪区", "翠峦区", "西林区", "金山屯区", "铁力市"], ["东风区", "前进区", "同江市", "向阳区", "富锦市", "抚远县", "桦南县", "桦川县", "汤原县", "郊区"], ["勃利县", "新兴区", "桃山区", "茄子河区"], ["东宁县", "东安区", "宁安市", "林口县", "海林市", "爱民区", "穆棱市", "绥芬河市", "西安区", "阳明区"], ["五大连池市", "北安市", "嫩江县", "孙吴县", "爱辉区", "车逊克县", "逊克县"], ["兰西县", "安达市", "庆安县", "明水县", "望奎县", "海伦市", "绥化市北林区", "绥棱县", "肇东市", "青冈县"], ["呼玛县", "塔河县", "大兴安岭地区加格达奇区", "大兴安岭地区呼中区", "大兴安岭地区新林区", "大兴安岭地区松岭区", "漠河县"]], [["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县"]], [["下关区", "六合区", "建邺区", "栖霞区", "江宁区", "浦口区", "溧水县", "玄武区", "白下区", "秦淮区", "雨花台区", "高淳县", "鼓楼区"], ["北塘区", "南长区", "宜兴市", "崇安区", "惠山区", "江阴市", "滨湖区", "锡山区"], ["丰县", "九里区", "云龙区", "新沂市", "沛县", "泉山区", "睢宁县", "贾汪区", "邳州市", "铜山县", "鼓楼区"], ["天宁区", "戚墅堰区", "新北区", "武进区", "溧阳市", "金坛市", "钟楼区"], ["吴中区", "吴江市", "太仓市", "常熟市", "平江区", "张家港市", "昆山市", "沧浪区", "相城区", "苏州工业园区", "虎丘区", "金阊区"], ["启东市", "如东县", "如皋市", "崇川区", "海安县", "海门市", "港闸区", "通州市"], ["东海县", "新浦区", "海州区", "灌云县", "灌南县", "赣榆县", "连云区"], ["楚州区", "洪泽县", "涟水县", "淮阴区", "清河区", "清浦区", "盱眙县", "金湖县"], ["东台市", "亭湖区", "响水县", "大丰市", "射阳县", "建湖县", "滨海县", "盐都区", "阜宁县"], ["仪征市", "宝应县", "广陵区", "江都市", "维扬区", "邗江区", "高邮市"], ["丹徒区", "丹阳市", "京口区", "句容市", "扬中市", "润州区"], ["兴化市", "姜堰市", "泰兴市", "海陵区", "靖江市", "高港区"], ["宿城区", "宿豫区", "沭阳县", "泗洪县", "泗阳县"]], [["上城区", "下城区", "临安市", "余杭区", "富阳市", "建德市", "拱墅区", "桐庐县", "江干区", "淳安县", "滨江区", "萧山区", "西湖区"], ["余姚市", "北仑区", "奉化市", "宁海县", "慈溪市", "江东区", "江北区", "海曙区", "象山县", "鄞州区", "镇海区"], ["乐清市", "平阳县", "文成县", "永嘉县", "泰顺县", "洞头县", "瑞安市", "瓯海区", "苍南县", "鹿城区", "龙湾区"], ["南湖区", "嘉善县", "平湖市", "桐乡市", "海宁市", "海盐县", "秀洲区"], ["南浔区", "吴兴区", "安吉县", "德清县", "长兴县"], ["上虞市", "嵊州市", "新昌县", "绍兴县", "诸暨市", "越城区"], ["定海区", "岱山县", "嵊泗县", "普陀区"], ["常山县", "开化县", "柯城区", "江山市", "衢江区", "龙游县"], ["东阳市", "义乌市", "兰溪市", "婺城区", "武义县", "永康市", "浦江县", "磐安县", "金东区"], ["三门县", "临海市", "仙居县", "天台县", "椒江区", "温岭市", "玉环县", "路桥区", "黄岩区"], ["云和县", "庆元县", "景宁畲族自治县", "松阳县", "缙云县", "莲都区", "遂昌县", "青田县", "龙泉市"]], [["包河区", "庐阳区", "瑶海区", "肥东县", "肥西县", "蜀山区", "长丰县"], ["三山区", "南陵县", "弋江区", "繁昌县", "芜湖县", "镜湖区", "鸠江区"], ["五河县", "固镇县", "怀远县", "淮上区", "禹会区", "蚌山区", "龙子湖区"], ["八公山区", "凤台县", "大通区", "潘集区", "田家庵区", "谢家集区"], ["当涂县", "花山区", "金家庄区", "雨山区"], ["杜集区", "濉溪县", "烈山区", "相山区"], ["狮子山区", "郊区", "铜官山区", "铜陵县"], ["大观区", "太湖县", "宜秀区", "宿松县", "岳西县", "怀宁县", "望江县", "枞阳县", "桐城市", "潜山县", "迎江区"], ["休宁县", "屯溪区", "徽州区", "歙县", "祁门县", "黄山区", "黟县"], ["全椒县", "凤阳县", "南谯区", "天长市", "定远县", "明光市", "来安县", "琅玡区"], ["临泉县", "太和县", "界首市", "阜南县", "颍东区", "颍州区", "颍泉区", "颖上县"], ["埇桥区", "泗县辖", "灵璧县", "砀山县", "萧县"], ["含山县", "和县", "居巢区", "庐江县", "无为县"], ["寿县", "舒城县", "裕安区", "金安区", "金寨县", "霍山县", "霍邱县"], ["利辛县", "涡阳县", "蒙城县", "谯城区"], ["东至县", "石台县", "贵池区", "青阳县"], ["宁国市", "宣州区", "广德县", "旌德县", "泾县", "绩溪县", "郎溪县"]], [["仓山区", "台江区", "平潭县", "晋安区", "永泰县", "福清市", "罗源县", "连江县", "长乐市", "闽侯县", "闽清县", "马尾区", "鼓楼区"], ["同安区", "思明区", "海沧区", "湖里区", "翔安区", "集美区"], ["仙游县", "城厢区", "涵江区", "秀屿区", "荔城区"], ["三元区", "大田县", "宁化县", "将乐县", "尤溪县", "建宁县", "明溪县", "梅列区", "永安市", "沙县", "泰宁县", "清流县"], ["丰泽区", "南安市", "安溪县", "德化县", "惠安县", "晋江市", "永春县", "泉港区", "洛江区", "石狮市", "金门县", "鲤城区"], ["东山县", "云霄县", "华安县", "南靖县", "平和县", "漳浦县", "芗城区", "诏安县", "长泰县", "龙文区", "龙海市"], ["光泽县", "延平区", "建瓯市", "建阳市", "政和县", "松溪县", "武夷山市", "浦城县", "邵武市", "顺昌县"], ["上杭县", "新罗区", "武平县", "永定县", "漳平市", "连城县", "长汀县"], ["古田县", "周宁县", "寿宁县", "屏南县", "柘荣县", "福安市", "福鼎市", "蕉城区", "霞浦县"]], [["东湖区", "南昌县", "安义县", "新建县", "湾里区", "西湖区", "进贤县", "青云谱区", "青山湖区"], ["乐平市", "昌江区", "浮梁县", "珠山区"], ["上栗县", "安源区", "湘东区", "芦溪县", "莲花县"], ["九江县", "修水县", "庐山区", "彭泽县", "德安县", "星子县", "武宁县", "永修县", "浔阳区", "湖口县", "瑞昌市", "都昌县"], ["分宜县", "渝水区"], ["余江县", "月湖区", "贵溪市"], ["上犹县", "于都县", "会昌县", "信丰县", "全南县", "兴国县", "南康市", "大余县", "宁都县", "安远县", "定南县", "寻乌县", "崇义县", "瑞金市", "石城县", "章贡区", "赣县", "龙南县"], ["万安县", "井冈山市", "吉安县", "吉州区", "吉水县", "安福县", "峡江县", "新干县", "永丰县", "永新县", "泰和县", "遂川县", "青原区"], ["万载县", "上高县", "丰城市", "奉新县", "宜丰县", "樟树市", "袁州区", "铜鼓县", "靖安县", "高安市"], ["东乡县", "临川区", "乐安县", "南丰县", "南城县", "宜黄县", "崇仁县", "广昌县", "资溪县", "金溪县", "黎川县"], ["万年县", "上饶县", "余干县", "信州区", "婺源县", "广丰县", "弋阳县", "德兴市", "横峰县", "玉山县", "鄱阳县", "铅山县"]], [["历下区", "历城区", "商河县", "天桥区", "市中区", "平阴县", "槐荫区", "济阳县", "章丘市", "长清区"], ["即墨市", "四方区", "城阳区", "崂山区", "市北区", "市南区", "平度市", "李沧区", "胶南市", "胶州市", "莱西市", "黄岛区"], ["临淄区", "博山区", "周村区", "张店区", "桓台县", "沂源县", "淄川区", "高青县"], ["台儿庄区", "山亭区", "峄城区", "市中区", "滕州市", "薛城区"], ["东营区", "利津县", "垦利县", "广饶县", "河口区"], ["招远市", "栖霞市", "海阳市", "牟平区", "福山区", "芝罘区", "莱山区", "莱州市", "莱阳市", "蓬莱市", "长岛县", "龙口市"], ["临朐县", "坊子区", "奎文区", "安丘市", "寒亭区", "寿光市", "昌乐县", "昌邑市", "潍城区", "诸城市", "青州市", "高密市"], ["任城区", "兖州市", "嘉祥县", "市中区", "微山县", "曲阜市", "梁山县", "汶上县", "泗水县", "邹城市", "金乡县", "鱼台县"], ["东平县", "宁阳县", "岱岳区", "新泰市", "泰山区", "肥城市"], ["乳山市", "文登市", "环翠区", "荣成市"], ["东港区", "五莲县", "岚山区", "莒县"], ["莱城区", "钢城区"], ["临沭县", "兰山区", "平邑县", "沂南县", "沂水县", "河东区", "罗庄区", "苍山县", "莒南县", "蒙阴县", "费县", "郯城县"], ["临邑县", "乐陵市", "夏津县", "宁津县", "平原县", "庆云县", "德城区", "武城县", "禹城市", "陵县", "齐河县"], ["东昌府区", "东阿县", "临清市", "冠县", "茌平县", "莘县", "阳谷县", "高唐县"], ["博兴县", "惠民县", "无棣县", "沾化县", "滨城区", "邹平县", "阳信县"], ["东明县", "单县", "定陶县", "巨野县", "成武县", "曹县", "牡丹区", "郓城县", "鄄城县"]], [["上街区", "中原区", "中牟县", "二七区", "巩义市", "惠济区", "新密市", "新郑市", "登封市", "管城回族区", "荥阳市", "金水区"], ["兰考县", "尉氏县", "开封县", "杞县", "禹王台区", "通许县", "金明区", "顺河回族区", "鼓楼区", "龙亭区"], ["伊川县", "偃师市", "吉利区", "孟津县", "宜阳县", "嵩县", "新安县", "栾川县", "汝阳县", "洛宁县", "洛龙区", "涧西区", "瀍河回族区", "老城区", "西工区"], ["卫东区", "叶县", "宝丰县", "新华区", "汝州市", "湛河区", "石龙区", "舞钢市", "郏县", "鲁山县"], ["内黄县", "北关区", "安阳县", "文峰区", "林州市", "殷都区", "汤阴县", "滑县", "龙安区"], ["山城区", "浚县", "淇县", "淇滨区", "鹤山区"], ["凤泉区", "卫滨区", "卫辉市", "原阳县", "封丘县", "延津县", "新乡县", "牧野区", "红旗区", "获嘉县", "辉县市", "长垣县"], ["中站区", "修武县", "博爱县", "孟州市", "山阳区", "武陟县", "沁阳市", "温县", "解放区", "马村区"], ["华龙区", "南乐县", "台前县", "清丰县", "濮阳县", "范县"], ["禹州市", "襄城县", "许昌县", "鄢陵县", "长葛市", "魏都区"], ["临颍县", "召陵区", "源汇区", "舞阳县", "郾城区"], ["义马市", "卢氏县", "渑池县", "湖滨区", "灵宝市", "陕县"], ["内乡县", "南召县", "卧龙区", "唐河县", "宛城区", "新野县", "方城县", "桐柏县", "淅川县", "社旗县", "西峡县", "邓州市", "镇平县"], ["夏邑县", "宁陵县", "柘城县", "民权县", "永城市", "睢县", "睢阳区", "粱园区", "虞城县"], ["光山县", "商城县", "固始县", "平桥区", "息县", "新县", "浉河区", "淮滨县", "潢川县", "罗山县"], ["商水县", "太康县", "川汇区", "扶沟县", "沈丘县", "淮阳县", "西华县", "郸城县", "项城市", "鹿邑县"], ["上蔡县", "平舆县", "新蔡县", "正阳县", "汝南县", "泌阳县", "确山县", "西平县", "遂平县", "驿城区"], ["济源市"]], [["东西湖区", "新洲区", "武昌区", "汉南区", "汉阳区", "江夏区", "江岸区", "江汉区", "洪山区", "硚口区", "蔡甸区", "青山区", "黄陂区"], ["下陆区", "大冶市", "西塞山区", "铁山区", "阳新县", "黄石港区"], ["丹江口市", "张湾区", "房县", "竹山县", "竹溪县", "茅箭区", "郧县", "郧西县"], ["五峰土家族自治县", "伍家岗区", "兴山县", "夷陵区", "宜都市", "当阳市", "枝江市", "点军区", "秭归县", "虢亭区", "西陵区", "远安县", "长阳土家族自治县"], ["保康县", "南漳县", "宜城市", "枣阳市", "樊城区", "老河口市", "襄城区", "襄阳区", "谷城县"], ["华容区", "粱子湖", "鄂城区"], ["东宝区", "京山县", "掇刀区", "沙洋县", "钟祥市"], ["云梦县", "大悟县", "孝南区", "孝昌县", "安陆市", "应城市", "汉川市"], ["公安县", "松滋市", "江陵县", "沙市区", "洪湖市", "监利县", "石首市", "荆州区"], ["团风县", "武穴市", "浠水县", "红安县", "罗田县", "英山县", "蕲春县", "麻城市", "黄州区", "黄梅县"], ["咸安区", "嘉鱼县", "崇阳县", "赤壁市", "通城县", "通山县"], ["广水市", "曾都区"], ["利川市", "咸丰县", "宣恩县", "巴东县", "建始县", "恩施市", "来凤县", "鹤峰县"], ["仙桃市"], ["潜江市"], ["天门市"], ["神农架林区"]], [["天心区", "宁乡县", "岳麓区", "开福区", "望城县", "浏阳市", "芙蓉区", "长沙县", "雨花区"], ["天元区", "攸县", "株洲县", "炎陵县", "石峰区", "芦淞区", "茶陵县", "荷塘区", "醴陵市"], ["岳塘区", "湘乡市", "湘潭县", "雨湖区", "韶山市"], ["南岳区", "常宁市", "珠晖区", "石鼓区", "祁东县", "耒阳市", "蒸湘区", "衡东县", "衡南县", "衡山县", "衡阳县", "雁峰区"], ["北塔区", "双清区", "城步苗族自治县", "大祥区", "新宁县", "新邵县", "武冈市", "洞口县", "绥宁县", "邵东县", "邵阳县", "隆回县"], ["临湘市", "云溪区", "华容县", "君山区", "岳阳县", "岳阳楼区", "平江县", "汨罗市", "湘阴县"], ["临澧县", "安乡县", "桃源县", "武陵区", "汉寿县", "津市市", "澧县", "石门县", "鼎城区"], ["慈利县", "桑植县", "武陵源区", "永定区"], ["南县", "安化县", "桃江县", "沅江市", "资阳区", "赫山区"], ["临武县", "北湖区", "嘉禾县", "安仁县", "宜章县", "桂东县", "桂阳县", "永兴县", "汝城县", "苏仙区", "资兴市"], ["东安县", "冷水滩区", "双牌县", "宁远县", "新田县", "江华瑶族自治县", "江永县", "祁阳县", "蓝山县", "道县", "零陵区"], ["中方县", "会同县", "新晃侗族自治县", "沅陵县", "洪江市/洪江区", "溆浦县", "芷江侗族自治县", "辰溪县", "通道侗族自治县", "靖州苗族侗族自治县", "鹤城区", "麻阳苗族自治县"], ["冷水江市", "双峰县", "娄星区", "新化县", "涟源市"], ["保靖县", "凤凰县", "古丈县", "吉首市", "永顺县", "泸溪县", "花垣县", "龙山县"]], [["萝岗区", "南沙区", "从化市", "增城市", "天河区", "海珠区", "番禺区", "白云区", "花都区", "荔湾区", "越秀区", "黄埔区"], ["乐昌市", "乳源瑶族自治县", "仁化县", "南雄市", "始兴县", "新丰县", "曲江区", "武江区", "浈江区", "翁源县"], ["南山区", "宝安区", "盐田区", "福田区", "罗湖区", "龙岗区"], ["斗门区", "金湾区", "香洲区"], ["南澳县", "潮南区", "潮阳区", "澄海区", "濠江区", "金平区", "龙湖区"], ["三水区", "南海区", "禅城区", "顺德区", "高明区"], ["台山市", "开平市", "恩平市", "新会区", "江海区", "蓬江区", "鹤山市"], ["吴川市", "坡头区", "廉江市", "徐闻县", "赤坎区", "遂溪县", "雷州市", "霞山区", "麻章区"], ["信宜市", "化州市", "电白县", "茂南区", "茂港区", "高州市"], ["四会市", "封开县", "广宁县", "德庆县", "怀集县", "端州区", "高要市", "鼎湖区"], ["博罗县", "惠东县", "惠城区", "惠阳区", "龙门县"], ["丰顺县", "五华县", "兴宁市", "大埔县", "平远县", "梅县", "梅江区", "蕉岭县"], ["城区", "海丰县", "陆丰市", "陆河县"], ["东源县", "和平县", "源城区", "紫金县", "连平县", "龙川县"], ["江城区", "阳东县", "阳春市", "阳西县"], ["佛冈县", "清城区", "清新县", "英德市", "连南瑶族自治县", "连山壮族瑶族自治县", "连州市", "阳山县"], ["东莞市"], ["中山市"], ["湘桥区", "潮安县", "饶平县"], ["惠来县", "揭东县", "揭西县", "普宁市", "榕城区"], ["云城区", "云安县", "新兴县", "罗定市", "郁南县"]], [["上林县", "兴宁区", "宾阳县", "横县", "武鸣县", "江南区", "良庆区", "西乡塘区", "邕宁区", "隆安县", "青秀区", "马山县"], ["三江侗族自治县", "城中区", "柳北区", "柳南区", "柳城县", "柳江县", "融安县", "融水苗族自治县", "鱼峰区", "鹿寨县"], ["七星区", "临桂县", "全州县", "兴安县", "叠彩区", "平乐县", "恭城瑶族自治县", "永福县", "灌阳县", "灵川县", "秀峰区", "荔浦县", "象山区", "资源县", "阳朔县", "雁山区", "龙胜各族自治县"], ["万秀区", "岑溪市", "苍梧县", "蒙山县", "藤县", "蝶山区", "长洲区"], ["合浦县", "海城区", "铁山港区", "银海区"], ["上思县", "东兴市", "港口区", "防城区"], ["浦北县", "灵山县", "钦北区", "钦南区"], ["平南县", "桂平市", "港北区", "港南区", "覃塘区"], ["兴业县", "北流市", "博白县", "容县", "玉州区", "陆川县"], ["乐业县", "凌云县", "右江区", "平果县", "德保县", "田东县", "田林县", "田阳县", "西林县", "那坡县", "隆林各族自治县", "靖西县"], ["八步区", "富川瑶族自治县", "昭平县", "钟山县"], ["东兰县", "凤山县", "南丹县", "大化瑶族自治县", "天峨县", "宜州市", "巴马瑶族自治县", "环江毛南族自治县", "罗城仫佬族自治县", "都安瑶族自治县", "金城江区"], ["兴宾区", "合山市", "忻城县", "武宣县", "象州县", "金秀瑶族自治县"], ["凭祥市", "大新县", "天等县", "宁明县", "扶绥县", "江州区", "龙州县"]], [["琼山区", "秀英区", "美兰区", "龙华区"], ["三亚市"], ["五指山市"], ["琼海市"], ["儋州市"], ["文昌市"], ["万宁市"], ["东方市"], ["定安县"], ["屯昌县"], ["澄迈县"], ["临高县"], ["白沙黎族自治县"], ["昌江黎族自治县"], ["乐东黎族自治县"], ["陵水黎族自治县"], ["保亭黎族苗族自治县"], ["琼中黎族苗族自治县"], [], [], []], [["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "双桥区", "万盛区", "渝北区", "巴南区", "黔江区", "长寿区", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "开县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", "江津市", "合川市", "永川市", "南川市"]], [["双流县", "大邑县", "崇州市", "彭州市", "成华区", "新津县", "新都区", "武侯区", "温江区", "蒲江县", "邛崃市", "郫县", "都江堰市", "金堂县", "金牛区", "锦江区", "青白江区", "青羊区", "龙泉驿区"], ["大安区", "富顺县", "沿滩区", "自流井区", "荣县", "贡井区"], ["东区", "仁和区", "盐边县", "米易县", "西区"], ["叙永县", "古蔺县", "合江县", "江阳区", "泸县", "纳溪区", "龙马潭区"], ["中江县", "什邡市", "广汉市", "旌阳区", "绵竹市", "罗江县"], ["三台县", "北川羌族自治县", "安县", "平武县", "梓潼县", "江油市", "涪城区", "游仙区", "盐亭县"], ["元坝区", "利州区", "剑阁县", "旺苍县", "朝天区", "苍溪县", "青川县"], ["大英县", "安居区", "射洪县", "船山区", "蓬溪县"], ["东兴区", "威远县", "市中区", "资中县", "隆昌县"], ["五通桥区", "井研县", "夹江县", "峨眉山市", "峨边彝族自治县", "市中区", "沐川县", "沙湾区", "犍为县", "金口河区", "马边彝族自治县"], ["仪陇县", "南充市嘉陵区", "南部县", "嘉陵区", "营山县", "蓬安县", "西充县", "阆中市", "顺庆区", "高坪区"], ["东坡区", "丹棱县", "仁寿县", "彭山县", "洪雅县", "青神县"], ["兴文县", "南溪县", "宜宾县", "屏山县", "江安县", "珙县", "筠连县", "翠屏区", "长宁县", "高县"], ["华蓥市", "岳池县", "广安区", "武胜县", "邻水县"], ["万源市", "大竹县", "宣汉县", "开江县", "渠县", "达县", "通川区"], ["名山县", "天全县", "宝兴县", "汉源县", "石棉县", "芦山县", "荥经县", "雨城区"], ["南江县", "巴州区", "平昌县", "通江县"], ["乐至县", "安岳县", "简阳市", "雁江区"], ["九寨沟县", "壤塘县", "小金县", "松潘县", "汶川县", "理县", "红原县", "若尔盖县", "茂县", "金川县", "阿坝县", "马尔康县", "黑水县"], ["丹巴县", "乡城县", "巴塘县", "康定县", "得荣县", "德格县", "新龙县", "泸定县", "炉霍县", "理塘县", "甘孜县", "白玉县", "石渠县", "稻城县", "色达县", "道孚县", "雅江县"], ["会东县", "会理县", "冕宁县", "喜德县", "宁南县", "布拖县", "德昌县", "昭觉县", "普格县", "木里藏族自治县", "甘洛县", "盐源县", "美姑县", "西昌", "越西县", "金阳县", "雷波县"]], [["乌当区", "云岩区", "修文县", "南明区", "小河区", "开阳县", "息烽县", "清镇市", "白云区", "花溪区"], ["六枝特区", "水城县", "盘县", "钟山区"], ["习水县", "仁怀市", "余庆县", "凤冈县", "务川仡佬族苗族自治县", "桐梓县", "正安县", "汇川区", "湄潭县", "红花岗区", "绥阳县", "赤水市", "道真仡佬族苗族自治县", "遵义县"], ["关岭布依族苗族自治县", "平坝县", "普定县", "紫云苗族布依族自治县", "西秀区", "镇宁布依族苗族自治县"], ["万山特区", "印江土家族苗族自治县", "德江县", "思南县", "松桃苗族自治县", "江口县", "沿河土家族自治县", "玉屏侗族自治县", "石阡县", "铜仁市"], ["兴义市", "兴仁县", "册亨县", "安龙县", "普安县", "晴隆县", "望谟县", "贞丰县"], ["大方县", "威宁彝族回族苗族自治县", "毕节市", "纳雍县", "织金县", "赫章县", "金沙县", "黔西县"], ["三穗县", "丹寨县", "从江县", "凯里市", "剑河县", "台江县", "天柱县", "岑巩县", "施秉县", "榕江县", "锦屏县", "镇远县", "雷山县", "麻江县", "黄平县", "黎平县"], ["三都水族自治县", "平塘县", "惠水县", "独山县", "瓮安县", "福泉市", "罗甸县", "荔波县", "贵定县", "都匀市", "长顺县", "龙里县"]], [["东川区", "五华区", "呈贡县", "安宁市", "官渡区", "宜良县", "富民县", "寻甸回族彝族自治县", "嵩明县", "晋宁县", "盘龙区", "石林彝族自治县", "禄劝彝族苗族自治县", "西山区"], ["会泽县", "宣威市", "富源县", "师宗县", "沾益县", "罗平县", "陆良县", "马龙县", "麒麟区"], ["元江哈尼族彝族傣族自治县", "华宁县", "峨山彝族自治县", "新平彝族傣族自治县", "易门县", "江川县", "澄江县", "红塔区", "通海县"], ["施甸县", "昌宁县", "腾冲县", "隆阳区", "龙陵县"], ["大关县", "威信县", "巧家县", "彝良县", "昭阳区", "水富县", "永善县", "盐津县", "绥江县", "镇雄县", "鲁甸县"], ["华坪县", "古城区", "宁蒗彝族自治县", "永胜县", "玉龙纳西族自治县"], [], ["临翔区", "云县", "凤庆县", "双江拉祜族佤族布朗族傣族自治县", "永德县", "沧源佤族自治县", "耿马傣族佤族自治县", "镇康县"], ["元谋县", "南华县", "双柏县", "大姚县", "姚安县", "楚雄市", "武定县", "永仁县", "牟定县", "禄丰县"], ["个旧市", "元阳县", "屏边苗族自治县", "建水县", "开远市", "弥勒县", "河口瑶族自治县", "泸西县", "石屏县", "红河县", "绿春县", "蒙自县", "金平苗族瑶族傣族自治县"], ["丘北县", "富宁县", "广南县", "文山县", "砚山县", "西畴县", "马关县", "麻栗坡县"], ["勐海县", "勐腊县", "景洪市"], ["云龙县", "剑川县", "南涧彝族自治县", "大理市", "宾川县", "巍山彝族回族自治县", "弥渡县", "永平县", "洱源县", "漾濞彝族自治县", "祥云县", "鹤庆县"], ["梁河县", "潞西市", "瑞丽市", "盈江县", "陇川县"], [], ["德钦县", "维西傈僳族自治县", "香格里拉县"]], [["城关区", "堆龙德庆县", "墨竹工卡县", "尼木县", "当雄县", "曲水县", "林周县", "达孜县"], ["丁青县", "八宿县", "察雅县", "左贡县", "昌都县", "江达县", "洛隆县", "类乌齐县", "芒康县", "贡觉县", "边坝县"], ["乃东县", "加查县", "扎囊县", "措美县", "曲松县", "桑日县", "洛扎县", "浪卡子县", "琼结县", "贡嘎县", "错那县", "隆子县"], ["亚东县", "仁布县", "仲巴县", "南木林县", "吉隆县", "定日县", "定结县", "岗巴县", "康马县", "拉孜县", "日喀则市", "昂仁县", "江孜县", "白朗县", "聂拉木县", "萨嘎县", "萨迦县", "谢通门县"], ["嘉黎县", "安多县", "尼玛县", "巴青县", "比如县", "班戈县", "申扎县", "索县", "聂荣县", "那曲县"], ["噶尔县", "措勤县", "改则县", "日土县", "普兰县", "札达县", "革吉县"], ["墨脱县", "察隅县", "工布江达县", "朗县", "林芝县", "波密县", "米林县"]], [["临潼区", "周至县", "户县", "新城区", "未央区", "灞桥区", "碑林区", "莲湖区", "蓝田县", "长安区", "阎良区", "雁塔区", "高陵县"], ["印台区", "宜君县", "王益区", "耀州区"], ["凤县", "凤翔县", "千阳县", "太白县", "岐山县", "扶风县", "渭滨区", "眉县", "金台区", "陇县", "陈仓区", "麟游县"], ["三原县", "干县", "兴平市", "彬县", "旬邑县", "杨陵区", "武功县", "永寿县", "泾阳县", "淳化县", "渭城区", "礼泉县", "秦都区", "长武县"], ["临渭区", "华县", "华阴市", "合阳县", "大荔县", "富平县", "潼关县", "澄城县", "白水县", "蒲城县", "韩城市"], ["吴起县", "子长县", "安塞县", "宜川县", "宝塔区", "富县", "延川县", "延长县", "志丹县", "洛川县", "甘泉县", "黄陵县", "黄龙县"], ["佛坪县", "勉县", "南郑县", "城固县", "宁强县", "汉台区", "洋县", "留坝县", "略阳县", "西乡县", "镇巴县"], ["佳县", "吴堡县", "子洲县", "定边县", "府谷县", "榆林市榆阳区", "横山县", "清涧县", "神木县", "米脂县", "绥德县", "靖边县"], ["宁陕县", "岚皋县", "平利县", "旬阳县", "汉滨区", "汉阴县", "白河县", "石泉县", "紫阳县", "镇坪县"], ["丹凤县", "商南县", "商州区", "山阳县", "柞水县", "洛南县", "镇安县"]], [["七里河区", "城关区", "安宁区", "榆中县", "永登县", "皋兰县", "红古区", "西固区"], ["嘉峪关市"], ["永昌县", "金川区"], ["会宁县", "平川区", "景泰县", "白银区", "靖远县"], ["张家川回族自治县", "武山县", "清水县", "甘谷县", "秦安县", "秦州区", "麦积区"], ["凉州区", "古浪县", "天祝藏族自治县", "民勤县"], ["临泽县", "山丹县", "民乐县", "甘州区", "肃南裕固族自治县", "高台县"], ["华亭县", "崆峒区", "崇信县", "庄浪县", "泾川县", "灵台县", "静宁县"], ["敦煌市", "玉门市", "瓜州县（原安西县）", "肃北蒙古族自治县", "肃州区", "金塔县", "阿克塞哈萨克族自治县"], ["华池县", "合水县", "宁县", "庆城县", "正宁县", "环县", "西峰区", "镇原县"], ["临洮县", "安定区", "岷县", "渭源县", "漳县", "通渭县", "陇西县"], ["两当县", "宕昌县", "康县", "徽县", "成县", "文县", "武都区", "礼县", "西和县"], ["东乡族自治县", "临夏县", "临夏市", "和政县", "广河县", "康乐县", "永靖县", "积石山保安族东乡族撒拉族自治县"], ["临潭县", "卓尼县", "合作市", "夏河县", "玛曲县", "碌曲县", "舟曲县", "迭部县"]], [["城东区", "城中区", "城北区", "城西区", "大通回族土族自治县", "湟中县", "湟源县"], ["乐都县", "互助土族自治县", "化隆回族自治县", "平安县", "循化撒拉族自治县", "民和回族土族自治县"], ["刚察县", "海晏县", "祁连县", "门源回族自治县"], ["同仁县", "尖扎县", "河南蒙古族自治县", "泽库县"], ["共和县", "兴海县", "同德县", "贵南县", "贵德县"], ["久治县", "玛多县", "玛沁县", "班玛县", "甘德县", "达日县"], ["囊谦县", "曲麻莱县", "杂多县", "治多县", "玉树县", "称多县"], ["乌兰县", "冷湖行委", "大柴旦行委", "天峻县", "德令哈市", "格尔木市", "茫崖行委", "都兰县"]], [["兴庆区", "永宁县", "灵武市", "西夏区", "贺兰县", "金凤区"], ["大武口区", "平罗县", "惠农区"], ["利通区", "同心县", "盐池县", "青铜峡市"], ["原州区", "彭阳县", "泾源县", "西吉县", "隆德县"], ["中宁县", "沙坡头区", "海原县"]], [["东山区", "乌鲁木齐县", "天山区", "头屯河区", "新市区", "水磨沟区", "沙依巴克区", "达坂城区"], ["乌尔禾区", "克拉玛依区", "独山子区", "白碱滩区"], ["吐鲁番市", "托克逊县", "鄯善县"], ["伊吾县", "哈密市", "巴里坤哈萨克自治县"], ["吉木萨尔县", "呼图壁县", "奇台县", "昌吉市", "木垒哈萨克自治县", "玛纳斯县", "米泉市", "阜康市"], ["博乐市", "温泉县", "精河县"], ["博湖县", "和硕县", "和静县", "尉犁县", "库尔勒市", "焉耆回族自治县", "若羌县", "轮台县"], ["乌什县", "库车县", "拜城县", "新和县", "柯坪县", "沙雅县", "温宿县", "阿克苏市", "阿瓦提县"], ["乌恰县", "阿克陶县", "阿合奇县", "阿图什市"], ["伽师县", "叶城县", "喀什市", "塔什库尔干塔吉克自治县", "岳普湖县", "巴楚县", "泽普县", "疏勒县", "疏附县", "英吉沙县", "莎车县", "麦盖提县"], ["于田县", "和田县", "和田市", "墨玉县", "民丰县", "洛浦县", "皮山县", "策勒县"], ["伊宁县", "伊宁市", "奎屯市", "察布查尔锡伯自治县", "尼勒克县", "巩留县", "新源县", "昭苏县", "特克斯县", "霍城县"], ["乌苏市", "和布克赛尔蒙古自治县", "塔城市", "托里县", "沙湾县", "裕民县", "额敏县"], ["吉木乃县", "哈巴河县", "富蕴县", "布尔津县", "福海县", "阿勒泰市", "青河县"], ["石河子市"], ["阿拉尔市"], ["图木舒克市"], ["五家渠市"]], [["台北市", "高雄市", "基隆市", "台中市", "台南市", "新竹市", "嘉义市", "台北县", "宜兰县", "桃园县", "新竹县", "苗栗县", "台中县", "彰化县", "南投县", "云林县", "嘉义县", "台南县", "高雄县", "屏东县", "澎湖县", "台东县", "花莲县"], ["中西区", "东区", "九龙城区", "观塘区", "南区", "深水埗区", "黄大仙区", "湾仔区", "油尖旺区", "离岛区", "葵青区", "北区", "西贡区", "沙田区", "屯门区", "大埔区", "荃湾区", "元朗区"], ["澳门特别行政区"]], [["美国", "加拿大", "澳大利亚", "新西兰", "英国", "法国", "德国", "捷克", "荷兰", "瑞士", "希腊", "挪威", "瑞典", "丹麦", "芬兰", "爱尔兰", "奥地利", "意大利", "乌克兰", "俄罗斯", "西班牙", "韩国", "新加坡", "马来西亚", "印度", "泰国", "日本", "巴西", "阿根廷", "南非", "埃及"]]],
        show_city: ["北京市"],
        show_area: ["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县", "其他"],
        area_value: [0, 0, 0],
        finish_hour: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
        finish_minute: ["00", "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48", "49", "50", "51", "52", "53", "54", "55", "56", "57", "58", "59"],
        finish_seconde: ["00", "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48", "49", "50", "51", "52", "53", "54", "55", "56", "57", "58", "59"],
        finish_value: [0, 0, 0],
        isattended: ['请选择是否参加过马拉松', '是', '否'],
        isattendedindex: 0,
        clothsize: ['请选择服装尺码', 'XS', 'S', 'M', 'L', 'XL', 'XXL'],
        clothindex: 0,
        bloodtype: ['请选择血型', 'A', 'B', 'AB', 'O'],
        bloodindex: 0,
        sexyarr: ["男", "女"],
        sexyindex: 0,
        now_day: '',
        birthday_time: '',
        pick_mask: false,
        finish_pick: false,
        country_pick: false,
        area_pick: false,
        china_main: true
    },
    birthday_change: function (e) {
        var temp_data = this.data.userdata;
        temp_data.birth = e.detail.value;
        this.setData({
            userdata: temp_data
        })
    },
    sexy_change: function (e) {
        var temp_data = this.data.userdata;
        temp_data.sexy = parseInt(e.detail.value) + 1;
        this.setData({
            userdata: temp_data,
            sexyindex: e.detail.value
        })
    },
    blood_change: function (e) {
        var temp_data = this.data.userdata;
        if (e.detail.value == 0) {
            temp_data.blood_type = '';
        }
        else {
            temp_data.blood_type = this.data.bloodtype[e.detail.value];
        }
        this.setData({
            userdata: temp_data,
            bloodindex: e.detail.value
        })
    },
    cloth_change: function (e) {
        var temp_data = this.data.userdata;
        if (e.detail.value == 0) {
            temp_data.cloth_size = '';
        }
        else {
            temp_data.cloth_size = this.data.clothsize[e.detail.value];
        }
        this.setData({
            userdata: temp_data,
            clothindex: e.detail.value
        })
    },
    issue_date_change: function (e) {
        var temp_data = this.data.userdata;
        temp_data.issue_date = e.detail.value;
        this.setData({
            userdata: temp_data
        })
    },
    expiry_date_change: function (e) {
        var temp_data = this.data.userdata;
        temp_data.expiry_date = e.detail.value;
        this.setData({
            userdata: temp_data
        })
    },
    isattended_change: function (e) {
        var temp_data = this.data.userdata;
        if (e.detail.value == 0) {
            temp_data.isattended = "";
        } else if (e.detail.value == 2){
            temp_data.isattended = 0;
        }else{
            temp_data.isattended = 1;
        }
        this.setData({
            isattendedindex: e.detail.value
        })
    },
    mask_hide: function () {
        this.setData({
            pick_mask: false,
            finish_pick: false,
            area_pick: false

        })
    },
    finish_choice: function () {
        this.setData({
            pick_mask: true,
            finish_pick: true
        })
    },
    finish_change: function (e) {
        this.setData({
            finish_value: e.detail.value
        })
    },
    finish_sure: function () {
        var temp_finish = this.data.finish_hour[this.data.finish_value[0]] + ':' + this.data.finish_minute[this.data.finish_value[1]] + ':' + this.data.finish_seconde[this.data.finish_value[2]];
        var temp_data = this.data.userdata;
        temp_data.wishfinish = temp_finish;
        this.setData({
            userdata: temp_data,
            pick_mask: false,
            finish_pick: false
        })
    },
    country_choice: function () {
        this.setData({
            pick_mask: true,
            country_pick: true
        })
    },
    country_change: function (e) {
        var continent_index = e.detail.value;
        var temp_countryarr = this.data.country_arr[continent_index[0]];
        this.setData({
            country_value: continent_index,
            show_country: temp_countryarr
        })
    },
    country_sure: function () {
        var temp_data = this.data.userdata;
        temp_data.broad_country = this.data.show_country[this.data.country_value[1]];
        if (this.data.country_value[0] == 0 && this.data.country_value[1] == 0) {
            var temp_china = true;
        } else {
            var temp_china = false;
        }

        this.setData({
            userdata: temp_data,
            pick_mask: false,
            country_pick: false,
            china_main: temp_china
        })
    },
    area_change: function (e) {
        var temp_index = e.detail.value;
        var temp_city = this.data.area_city[temp_index[0]];
        var temp_area = this.data.area_area[temp_index[0]][temp_index[1]];
        this.setData({
            show_city: temp_city,
            area_value: temp_index,
            show_area: temp_area
        })
    },
    area_sure: function () {
        var temp_data = this.data.userdata;
        var temp_index = this.data.area_value;
        var temp_area = this.data.area_province[temp_index[0]] + '-' + this.data.area_city[temp_index[0]][temp_index[1]] + '-' + this.data.area_area[temp_index[0]][temp_index[1]][temp_index[2]];
        temp_data.area = temp_area;
        this.setData({
            area_value: temp_index,
            userdata: temp_data,
            pick_mask: false,
            area_pick: false
        })
    },
    area_choice: function () {
        this.setData({
            pick_mask: true,
            area_pick: true
        })
    },
    bindmsg: function (e) {
        var temp_data = this.data.userdata;
        var temp_name = e.target.dataset.name;
        var temp_msg = e.detail.value;
        if (temp_name == 'surname' || temp_name == 'en_name'){
            temp_msg = temp_msg.toUpperCase() 
        }
        if (temp_name == 'sfz_code' && this.data.china_main){
            var _birthY = temp_msg.substr(6, 4);
            var _birthM = temp_msg.substr(10, 2);
            var _birthD = temp_msg.substr(12, 2);
            var _sexy = temp_msg.substr(16, 1);
            temp_data.birth = _birthY + '-' + _birthM + '-' + _birthD;
            if (_sexy % 2 == 0) {
                temp_data.sexy = '2';
            } else {
                temp_data.sexy = '1';
            }
        }
        temp_data[temp_name] = temp_msg;
        this.setData({
            userdata: temp_data
        })
    },
    fillmsg:function(that,res){
        var temp_data = res.data.data;
        var temp_index = 0;
        if (temp_data.birth == '') {
            temp_data.birth = '请选择日期';
        }
        if (temp_data.broad_country == '') {
            temp_data.broad_country = '中国大陆';
        }
        if (temp_data.broad_country != '中国大陆'){
            this.setData({
                china_main: false
            })
        }
        if (temp_data.area == '') {
            temp_data.area = '请选择地区';
        }
        if (temp_data.issue_date == '') {
            temp_data.issue_date = '请选择签发日期Date of issues';
        }
        if (temp_data.expiry_date == '') {
            temp_data.expiry_date = '请选择有效期Date of expiry';
        }
        if (temp_data.wishfinish == '') {
            temp_data.wishfinish = '请注明预期完赛时间';
        }
        if (temp_data.isattended == '0') {
            temp_index = 2;
        }
        if (temp_data.isattended == '1') {
            temp_index = 1;
        }
        that.setData({
            userdata: temp_data,
            isattendedindex: temp_index
        })
    },
    import_msg:function(){
        var that = this;
        app.wx_request('https://api.h5.zx-tour.com/H5User/getenrollinfo','post','json',{},that,function(res,that){
            if (res.data.data) {
                if (res.data.data.phone != that.data.userdata.phone) {
                    wx.showModal({
                        title: '信息冲突',
                        content: '导入手机号信息与当前手机号信息不匹，是否继续填充？',
                        success: function (_res) {
                            if (_res.confirm) {
                                that.fillmsg(that, res);
                            }
                        }
                    })
                }else{
                    that.fillmsg(that, res); 
                }
            } else {
                wx.showModal({
                    title: '导入错误',
                    content: '您暂未在知行平台上报过名！',
                    showCancel: false,
                })
            } 
        });
        // wx.request({
        //     url: 'https://api.h5.zx-tour.com/H5User/getenrollinfo?uid=31390',
        //     success:function(res){
        //         if(!res.data.data){
        //             if(res.data.data.phone != that.data.userdata.phone){
        //                 wx.showModal({
        //                     title: '信息冲突',
        //                     content: '导入手机号信息与当前手机号信息不匹，是否继续填充？',
        //                     success:function(_res){
        //                         if (_res.confirm) {
        //                             that.fillmsg(that, res);
        //                         }
        //                     }
        //                 }) 
        //             }
        //         }else{
        //             wx.showModal({
        //                 title: '导入错误',
        //                 content:'您暂未在知行平台上报过名！',
        //                 showCancel: false,
        //             })
        //         }
        //     }
        // })
    },
    checkIdcard: function (idcard) {
        var Errors = new Array(
            "验证通过!",
            "身份证号码位数不对!",
            "身份证号码出生日期超出范围或含有非法字符!",
            "身份证号码校验错误!",
            "身份证地区非法!"
        );
        var area = { 11: "北京", 12: "天津", 13: "河北", 14: "山西", 15: "内蒙古", 21: "辽宁", 22: "吉林", 23: "黑龙江", 31: "上海", 32: "江苏", 33: "浙江", 34: "安徽", 35: "福建", 36: "江西", 37: "山东", 41: "河南", 42: "湖	北", 43: "湖南", 44: "广东", 45: "广西", 46: "海南", 50: "重庆", 51: "四川", 52: "贵州", 53: "云南", 54: "西藏", 61: "陕西", 62: "甘肃", 63: "青海", 64: "宁夏", 65: "新疆", 71: "台湾", 81: "香港", 82: "澳门", 91: "国外" };
        var retflag = false;
        var idcard, Y, JYM;
        var S, M;
        var idcard_array = new Array();
        var ereg;
        idcard_array = idcard.split("");
        //地区检验
        if (area[parseInt(idcard.substr(0, 2))] == null) return Errors[4];
        //身份号码位数及格式检验
        switch (idcard.length) {
            case 15:
                if ((parseInt(idcard.substr(6, 2)) + 1900) % 4 == 0 || ((parseInt(idcard.substr(6, 2)) + 1900) % 100 == 0 && (parseInt(idcard.substr(6, 2)) + 1900) % 4 == 0)) {
                    ereg = /^[1-9][0-9]{5}[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}$/;//测试出生日期的合法性
                } 
                else {
                    ereg = /^[1-9][0-9]{5}[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))[0-9]{3}$/;//测试出生日期的合法性
                }
                if (ereg.test(idcard))
                    return Errors[0];
                else {
                    return Errors[2];
                }
                break;
            case 18:
                //18位身份号码检测
                //出生日期的合法性检查 
                //闰年月日:((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))
                //平年月日:((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))
                if (parseInt(idcard.substr(6, 4)) % 4 == 0 || (parseInt(idcard.substr(6, 4)) % 100 == 0 && parseInt(idcard.substr(6, 4)) % 4 == 0)) {
                    ereg = /^[1-9][0-9]{5}(19|20)[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}[0-9Xx]$/;//闰年出生日期的合法性正则表达式
                } 
                else {
                    ereg = /^[1-9][0-9]{5}(19|20)[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))[0-9]{3}[0-9Xx]$/;//平年出生日期的合法性正则表达式
                }
                if (ereg.test(idcard)) {//测试出生日期的合法性
                    //计算校验位
                    S = (parseInt(idcard_array[0]) + parseInt(idcard_array[10])) * 7 + (parseInt(idcard_array[1]) + parseInt(idcard_array[11])) * 9 + (parseInt(idcard_array[2]) + parseInt(idcard_array[12])) * 10 + (parseInt(idcard_array[3]) + parseInt(idcard_array[13])) * 5 + (parseInt(idcard_array[4]) + parseInt(idcard_array[14])) * 8 + (parseInt(idcard_array[5]) + parseInt(idcard_array[15])) * 4 + (parseInt(idcard_array[6]) + parseInt(idcard_array[16])) * 2 + parseInt(idcard_array[7]) * 1 + parseInt(idcard_array[8]) * 6 + parseInt(idcard_array[9]) * 3;
                    Y = S % 11;
                    M = "F";
                    JYM = "10X98765432";
                    M = JYM.substr(Y, 1);//判断校验位
                    if (M == idcard_array[17]) return Errors[0]; //检测ID的校验位
                    else return Errors[3];
                }
                else return Errors[2];
                break;
            default:
                return Errors[1];
                break;
        }
    },
    check_msg: function () {
        var error = false;
        var temp_data = this.data.userdata;
        for (var key in temp_data) {
            var tmep_msg = temp_data[key];
            if (key == 'sfz_code' && this.data.china_main && tmep_msg != '') {
                var msg = this.checkIdcard(tmep_msg);
                if (msg != "验证通过!"){
                    return {
                        "error": error,
                        "msg": msg
                    }
                }
            }
            if (this.data.china_main && key == 'contact_phone' && tmep_msg != ''){
                if(!/^1[\d]{10}$/.test(tmep_msg)){
                    return {
                        "error": error,
                        "msg":"请正确输入联系人电话"
                    }
                }
            }
            if (key == 'e_mail' && tmep_msg != ''){
                if (!/^([a-zA-Z0-9_-|.])+@([a-zA-Z0-9_-])+(.[a-zA-Z0-9_-])+/.test(tmep_msg)){
                    return {
                        "error": error,
                        "msg": "您的邮箱格式不正确！"
                    }
                }
            }
        }
        return {
            "error":true,
            "msg":'ok',
        }
    },
    save_msg: function () {
        var error = this.check_msg().error;
        var msg = this.check_msg().msg;
        if (error){
            var alldata = this.data.userdata;
            if (alldata.birth == '请选择日期') {
                alldata.birth = '';
            }
            if (alldata.broad_country == '中国大陆') {
                alldata.broad_country = '';
            }
            if (alldata.area == '请选择地区') {
                alldata.area = '';
            }
            if (alldata.issue_date == '请选择签发日期Date of issues') {
                alldata.issue_date = '';
            }
            if (alldata.expiry_date == '请选择有效期Date of expiry') {
                alldata.expiry_date = '';
            }
            if (alldata.wishfinish == '请注明预期完赛时间') {
                alldata.wishfinish = '';
            }
            var that = this;
            app.wx_request('https://api.h5.zx-tour.com/H5User/setuserinfo','post','json',alldata,that,function(res,that){
                wx.showToast({
                    title: '保存成功',
                    mask: true,
                    icon: 'success',
                    duration: 2000
                }) 
            },function(res,that){
                console.log(res);
                wx.showModal({
                    title: '信息错误',
                    content: res.data.msg,
                    showCancel: false,
                }) 
            });
            // wx.request({
            //     url: 'https://api.h5.zx-tour.com/H5User/setuserinfo?uid=31390',
            //     method:'POST',
            //     header: { 'content-type': 'application/x-www-form-urlencoded' },
            //     data:alldata,
            //     success:function(res){
            //         if(res.data.error == '0'){
            //             wx.showToast({
            //                 title: '保存成功',
            //                 mask: true,
            //                 icon: 'success',
            //                 duration: 2000
            //             })
            //         }else{
            //             wx.showModal({
            //                 title: '信息错误',
            //                 content: res.data.msg,
            //                 showCancel: false,
            //             }) 
            //         }
            //     }
            // })
        }else{
            wx.showModal({
                title: '信息错误',
                content: msg,
                showCancel: false,
            })
        }
    },
    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function (options) {
        var that = this;
        app.wx_request('https://api.h5.zx-tour.com/H5User/getuserinfo', 'post', 'json', {}, that, function (res, that) {
            that.setData({
                sign_ok: true,
                data_ready: true
            })
            that.fillmsg(that, res);
        }, function (res, that) {
            return false;
        }, true, function (res) {
            if (res.data.error == '305') {
                that.setData({
                    data_ready: true,
                    sign_ok: false
                })
            }
        });
        
        // wx.request({
        //     url: 'https://api.h5.zx-tour.com/H5User/setuserinfo?uid=31390',
        //     success:function(res){
        //         that.fillmsg(that,res);
        //     },
        // })
        var today = new Date();
        var today_year = today.getFullYear();
        var today_month = '';
        var today_day = '';
        if (today.getMonth() + 1 < 10) {
            today_month = "0" + (today.getMonth() + 1);
        }
        if (today.getDay() < 10) {
            today_day = "0" + today.getDay();
        }
        today = today_year + '-' + today_month + '-' + today_day;
        this.setData({
            now_day: today,
            birthday_time: today
        })
        wx.setNavigationBarTitle({
            title: '资料'
        })
    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady: function () {
        
    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function () {
        
    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide: function () {
        
    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload: function () {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function () {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function () {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage: function () {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function () {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function () {

    }
})